# WireframeBuilder Properties

---
The WireframeBuilder type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from ShapeBuilder)
Top
#### Reference
WireframeBuilder Class
Autodesk.Revit.DB Namespace